Сверт2.ОценкаСостоянияПредприятия/src/Reports/ОценкаЛиквидности/ОценкаЛиквидности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОценкаЛиквидности</name>
</mdclass:Report>

Сверт2.ОценкаСостоянияПредприятия/src/InformationRegisters/ПоказателиДляОтчета/ПоказателиДляОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиДляОтчета</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ОценкиБА</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Сверт2.ОценкаСостоянияПредприятия/src/Reports/ОценкаЛиквидности/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Визуальный отчёт по оценкам ликвидности: коэффициент, цветная шкала, оценка БА, интерпретация.
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПериодОтчета = ПолучитьПериодОтчета();
	Организация = ПолучитьОрганизацию();
	СтандартнаяОбработка = Ложь;
	СформироватьОтчет(ДокументРезультат, ПериодОтчета, Организация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонстантыОформления

Функция КолонкаПоказатель()
	Возврат 1;
КонецФункции

Функция КолонкаКоэффициент()
	Возврат 2;
КонецФункции

Функция КолонкаНорма()
	Возврат 3;
КонецФункции

Функция КолонкаШкалаНачало()
	Возврат 4;
КонецФункции

Функция ШиринаШкалыСегментов()
	Возврат 16;
КонецФункции

Функция КолонкаОценкаБА()
	Возврат КолонкаШкалаНачало() + ШиринаШкалыСегментов();
КонецФункции

Функция КолонкаУровень()
	Возврат КолонкаОценкаБА() + 1;
КонецФункции

Функция КолонкаИнтерпретация()
	Возврат КолонкаУровень() + 1;
КонецФункции

Функция ПоследняяКолонка()
	Возврат КолонкаИнтерпретация();
КонецФункции

#КонецОбласти

Функция ПолучитьПериодОтчета()
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ЗначениеПараметра = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если ЗначениеПараметра <> Неопределено И ЗначениеПараметра.Использование Тогда
		Период = ЗначениеПараметра.Значение;
		Если ТипЗнч(Период) = Тип("СтандартныйПериод")
			И ЗначениеЗаполнено(Период.ДатаНачала)
			И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			Возврат Период;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);
	
КонецФункции

Функция ПолучитьОрганизацию()
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ЗначениеПараметра = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	
	Если ЗначениеПараметра <> Неопределено И ЗначениеПараметра.Использование
		И ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
		Возврат ЗначениеПараметра.Значение;
	КонецЕсли;
	
	Возврат Справочники.Организации.ОрганизацияПоУмолчанию();
	
КонецФункции

Функция ОписаниеПоказателейЛиквидности()
	
	Описания = Новый Массив;
	
	Описания.Добавить(Новый Структура(
		"Наименование, КодКоэффициента, КодОценки, МинНорма, МаксНорма, МаксШкалы, Единица, ТекстНормы, ТекстНизко, ТекстВысоко",
		"Текущая ликвидность",
		"200", "199",
		1.5, 2.5, 3.75, "",
		"Норма: 1,5 – 2,5. Ниже 1,0 — риск неплатежеспособности, выше 3,0 — избыточные оборотные активы",
		"Недостаточно оборотных активов для покрытия краткосрочных обязательств",
		"Избыточная текущая ликвидность — возможна неэффективность использования активов"));
	
	Описания.Добавить(Новый Структура(
		"Наименование, КодКоэффициента, КодОценки, МинНорма, МаксНорма, МаксШкалы, Единица, ТекстНормы, ТекстНизко, ТекстВысоко",
		"Быстрая ликвидность",
		"204", "203",
		0.7, 1.0, 1.5, "",
		"Норма: 0,7 – 1,0. Ниже 0,7 — затруднения с погашением срочных обязательств",
		"Недостаточно высоколиквидных активов для быстрого расчёта по обязательствам",
		"Показатель выше нормы — возможен избыток денежных средств и краткосрочных вложений"));
	
	Описания.Добавить(Новый Структура(
		"Наименование, КодКоэффициента, КодОценки, МинНорма, МаксНорма, МаксШкалы, Единица, ТекстНормы, ТекстНизко, ТекстВысоко",
		"Абсолютная ликвидность",
		"210", "209",
		0.2, 0.5, 0.75, "",
		"Норма: 0,2 – 0,5. Ниже 0,2 — дефицит наиболее ликвидных активов",
		"Критически мало денежных средств и эквивалентов для срочных платежей",
		"Показатель выше нормы — значительный резерв немедленной ликвидности"));
	
	Возврат Описания;
	
КонецФункции

Функция ПолучитьЗначенияПоказателей(Организация, ПериодМесяца)
	
	Коды = Новый Массив;
	Коды.Добавить("58");
	Коды.Добавить("199");
	Коды.Добавить("200");
	Коды.Добавить("203");
	Коды.Добавить("204");
	Коды.Добавить("209");
	Коды.Добавить("210");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказателиДляОтчета.Показатель.Код КАК Код,
	|	ПоказателиДляОтчета.Оценка КАК Оценка
	|ИЗ
	|	РегистрСведений.ПоказателиДляОтчета КАК ПоказателиДляОтчета
	|ГДЕ
	|	ПоказателиДляОтчета.Период = &ПериодМесяца
	|	И ПоказателиДляОтчета.Организация = &Организация
	|	И ПоказателиДляОтчета.Показатель.Код В (&Коды)";
	
	Запрос.УстановитьПараметр("ПериодМесяца", НачалоМесяца(ПериодМесяца));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Коды", Коды);
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Код, Выборка.Оценка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьОтчет(ДокументРезультат, ПериодОтчета, Организация)
	
	ДокументРезультат.Очистить();
	НастроитьКолонки(ДокументРезультат);
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ДокументРезультат.Область(1, 1).Текст = "Укажите организацию в настройках отчёта";
		ДокументРезультат.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	ПериодМесяца = НачалоМесяца(ПериодОтчета.ДатаОкончания);
	ЗначенияПоказателей = ПолучитьЗначенияПоказателей(Организация, ПериодМесяца);
	ОписанияПоказателей = ОписаниеПоказателейЛиквидности();
	
	НомерСтроки = 1;
	НомерСтроки = ВывестиШапкуОтчета(ДокументРезультат, НомерСтроки, Организация, ПериодМесяца);
	
	ОбщаяОценка = ЗначенияПоказателей.Получить("58");
	Если ОбщаяОценка <> Неопределено Тогда
		НомерСтроки = НомерСтроки + 1;
		НомерСтроки = ВывестиБлокОбщейОценки(ДокументРезультат, НомерСтроки, ОбщаяОценка);
	КонецЕсли;
	
	НомерСтроки = НомерСтроки + 2;
	НомерСтрокиШапки = НомерСтроки;
	НомерСтроки = ВывестиШапкуТаблицы(ДокументРезультат, НомерСтроки);
	
	ЕстьДанные = Ложь;
	НомерКарточки = 0;
	
	Для Каждого Описание Из ОписанияПоказателей Цикл
		Коэффициент = ЗначенияПоказателей.Получить(Описание.КодКоэффициента);
		ОценкаБА = ЗначенияПоказателей.Получить(Описание.КодОценки);
		
		Если Коэффициент = Неопределено И ОценкаБА = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьДанные = Истина;
		НомерКарточки = НомерКарточки + 1;
		ИтоговаяОценка = ?(ОценкаБА <> Неопределено, ОценкаБА, РассчитатьОценкуПоКоэффициенту(Коэффициент, Описание));
		Интерпретация = ИнтерпретацияПоказателя(Коэффициент, ИтоговаяОценка, Описание);
		
		НомерСтроки = ВывестиКарточкуПоказателя(
			ДокументРезультат,
			НомерСтроки,
			Описание,
			Коэффициент,
			ИтоговаяОценка,
			Интерпретация,
			НомерКарточки);
	КонецЦикла;
	
	Если Не ЕстьДанные Тогда
		ДокументРезультат.Очистить();
		ДокументРезультат.Область(1, 1).Текст = СтрШаблон(
			"Нет данных по ликвидности за %1.%2 Загрузите оценки через «Интеграция бизнес аналитик».",
			Формат(ПериодМесяца, "ДФ=MMMM"),
			Символы.ПС);
		ДокументРезультат.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	НомерСтроки = НомерСтроки + 1;
	ВывестиЛегенду(ДокументРезультат, НомерСтроки);
	
	ДокументРезультат.ФиксацияСверху = НомерСтрокиШапки;
	ДокументРезультат.ФиксацияСлева = 1;
	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.ОтображатьСетку = Ложь;
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	
КонецПроцедуры

Процедура НастроитьКолонки(ДокументРезультат)
	
	УстановитьШиринуКолонки(ДокументРезультат, КолонкаПоказатель(), 28);
	УстановитьШиринуКолонки(ДокументРезультат, КолонкаКоэффициент(), 11);
	УстановитьШиринуКолонки(ДокументРезультат, КолонкаНорма(), 12);
	
	Для НомерСегмента = 0 По ШиринаШкалыСегментов() - 1 Цикл
		УстановитьШиринуКолонки(ДокументРезультат, КолонкаШкалаНачало() + НомерСегмента, 3.5);
	КонецЦикла;
	
	УстановитьШиринуКолонки(ДокументРезультат, КолонкаОценкаБА(), 11);
	УстановитьШиринуКолонки(ДокументРезультат, КолонкаУровень(), 16);
	УстановитьШиринуКолонки(ДокументРезультат, КолонкаИнтерпретация(), 42);
	
КонецПроцедуры

Функция ВывестиШапкуОтчета(ДокументРезультат, НомерСтроки, Организация, ПериодМесяца)
	
	ОбластьЗаголовка = ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки, ПоследняяКолонка());
	ОбластьЗаголовка.Объединить();
	ОбластьЗаголовка.Текст = "Оценка ликвидности предприятия";
	ОбластьЗаголовка.Шрифт = Новый Шрифт(, 16, Истина);
	ОбластьЗаголовка.ЦветФона = Новый Цвет(30, 58, 95);
	ОбластьЗаголовка.ЦветТекста = Новый Цвет(255, 255, 255);
	ОбластьЗаголовка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	ОбластьЗаголовка.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	УстановитьВысотуСтроки(ОбластьЗаголовка, 30);
	ПрименитьРамку(ОбластьЗаголовка);
	
	НомерСтроки = НомерСтроки + 1;
	ОбластьОрганизации = ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки, ПоследняяКолонка());
	ОбластьОрганизации.Объединить();
	ОбластьОрганизации.Текст = СтрШаблон("Организация: %1", Организация);
	ОбластьОрганизации.ЦветФона = Новый Цвет(241, 245, 249);
	ОбластьОрганизации.Шрифт = Новый Шрифт(, 10, Истина);
	УстановитьВысотуСтроки(ОбластьОрганизации, 20);
	
	НомерСтроки = НомерСтроки + 1;
	ОбластьПериода = ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки, ПоследняяКолонка());
	ОбластьПериода.Объединить();
	ОбластьПериода.Текст = СтрШаблон("Период: %1", Формат(ПериодМесяца, "ДФ='MMMM yyyy'"));
	ОбластьПериода.ЦветФона = Новый Цвет(241, 245, 249);
	ОбластьПериода.ЦветТекста = Новый Цвет(71, 85, 105);
	УстановитьВысотуСтроки(ОбластьПериода, 18);
	ПрименитьРамку(ОбластьПериода);
	
	Возврат НомерСтроки;
	
КонецФункции

Функция ВывестиБлокОбщейОценки(ДокументРезультат, НомерСтроки, ОбщаяОценка)
	
	ИнтерпретацияОбщая = ИнтерпретацияОценки(ОбщаяОценка);
	ОбластьИтога = ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки, ПоследняяКолонка());
	ОбластьИтога.Объединить();
	ОбластьИтога.Текст = СтрШаблон(
		"Общая оценка ликвидности: %1 из 5  |  %2  |  %3",
		Формат(ОбщаяОценка, "ЧДЦ=2"),
		ИнтерпретацияОбщая.Уровень,
		ИнтерпретацияОбщая.Описание);
	ОбластьИтога.ЦветФона = ИнтерпретацияОбщая.ЦветФона;
	ОбластьИтога.ЦветТекста = Новый Цвет(22, 78, 56);
	ОбластьИтога.Шрифт = Новый Шрифт(, 11, Истина);
	ОбластьИтога.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	ОбластьИтога.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	УстановитьВысотуСтроки(ОбластьИтога, 26);
	ПрименитьРамку(ОбластьИтога, 2);
	
	Возврат НомерСтроки;
	
КонецФункции

Функция ВывестиШапкуТаблицы(ДокументРезультат, НомерСтроки)
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить(КолонкаПоказатель(), "Показатель");
	Заголовки.Вставить(КолонкаКоэффициент(), "Коэффициент");
	Заголовки.Вставить(КолонкаНорма(), "Норма");
	Заголовки.Вставить(КолонкаОценкаБА(), "Оценка БА");
	Заголовки.Вставить(КолонкаУровень(), "Уровень");
	Заголовки.Вставить(КолонкаИнтерпретация(), "Интерпретация");
	
	ОбластьШкалы = ДокументРезультат.Область(
		НомерСтроки,
		КолонкаШкалаНачало(),
		НомерСтроки,
		КолонкаШкалаНачало() + ШиринаШкалыСегментов() - 1);
	ОбластьШкалы.Объединить();
	ОбластьШкалы.Текст = "Положение коэффициента";
	
	Для Каждого ЭлементЗаголовка Из Заголовки Цикл
		ОбластьЗаголовка = ДокументРезультат.Область(НомерСтроки, ЭлементЗаголовка.Ключ);
		ОбластьЗаголовка.Текст = ЭлементЗаголовка.Значение;
	КонецЦикла;
	
	ОбластьШапки = ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки, ПоследняяКолонка());
	ОбластьШапки.Шрифт = Новый Шрифт(, , Истина);
	ОбластьШапки.ЦветФона = Новый Цвет(51, 65, 85);
	ОбластьШапки.ЦветТекста = Новый Цвет(255, 255, 255);
	ОбластьШапки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьШапки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	УстановитьВысотуСтроки(ОбластьШапки, 22);
	ПрименитьРамку(ОбластьШапки);
	
	Возврат НомерСтроки + 1;
	
КонецФункции

Функция ВывестиКарточкуПоказателя(ДокументРезультат, НомерСтроки, Описание, Коэффициент, ИтоговаяОценка, Интерпретация, НомерКарточки)
	
	НомерСтрокиДанных = НомерСтроки;
	ЦветКарточки = ?(НомерКарточки % 2 = 0, Новый Цвет(248, 250, 252), Новый Цвет(255, 255, 255));
	
	ОбластьПоказателя = ДокументРезультат.Область(НомерСтрокиДанных, КолонкаПоказатель());
	ОбластьПоказателя.Текст = Описание.Наименование;
	ОбластьПоказателя.Шрифт = Новый Шрифт(, 10, Истина);
	ОбластьПоказателя.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьКоэффициента = ДокументРезультат.Область(НомерСтрокиДанных, КолонкаКоэффициент());
	Если Коэффициент <> Неопределено Тогда
		ОбластьКоэффициента.Текст = Формат(Коэффициент, "ЧДЦ=2");
		ОбластьКоэффициента.Шрифт = Новый Шрифт(, 11, Истина);
	Иначе
		ОбластьКоэффициента.Текст = "—";
	КонецЕсли;
	ОбластьКоэффициента.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	ОбластьНормы = ДокументРезультат.Область(НомерСтрокиДанных, КолонкаНорма());
	ОбластьНормы.Текст = СтрШаблон("%1 – %2", Формат(Описание.МинНорма, "ЧДЦ=1"), Формат(Описание.МаксНорма, "ЧДЦ=1"));
	ОбластьНормы.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьНормы.ЦветТекста = Новый Цвет(71, 85, 105);
	
	ОбластьОценки = ДокументРезультат.Область(НомерСтрокиДанных, КолонкаОценкаБА());
	Если ИтоговаяОценка <> Неопределено Тогда
		ОбластьОценки.Текст = Формат(ИтоговаяОценка, "ЧДЦ=2");
		ОбластьОценки.Шрифт = Новый Шрифт(, 11, Истина);
	Иначе
		ОбластьОценки.Текст = "—";
	КонецЕсли;
	ОбластьОценки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	ОбластьУровня = ДокументРезультат.Область(НомерСтрокиДанных, КолонкаУровень());
	ОбластьУровня.Текст = Интерпретация.Уровень;
	ОбластьУровня.ЦветФона = Интерпретация.ЦветФона;
	ОбластьУровня.ЦветТекста = Интерпретация.ЦветТекста;
	ОбластьУровня.Шрифт = Новый Шрифт(, , Истина);
	ОбластьУровня.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	ОбластьИнтерпретации = ДокументРезультат.Область(НомерСтрокиДанных, КолонкаИнтерпретация());
	ОбластьИнтерпретации.Текст = Интерпретация.Описание;
	ОбластьИнтерпретации.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ОбластьИнтерпретации.ЦветТекста = Новый Цвет(51, 65, 85);
	
	ОбластьДанных = ДокументРезультат.Область(НомерСтрокиДанных, 1, НомерСтрокиДанных, ПоследняяКолонка());
	ОбластьДанных.ЦветФона = ЦветКарточки;
	УстановитьВысотуСтроки(ОбластьДанных, 28);
	ПрименитьРамку(ОбластьДанных);
	
	НарисоватьЦветнуюШкалу(ДокументРезультат, НомерСтрокиДанных, Коэффициент, Описание);
	ОбластьУровня.ЦветФона = Интерпретация.ЦветФона;
	ОбластьУровня.ЦветТекста = Интерпретация.ЦветТекста;
	
	НомерСтроки = НомерСтрокиДанных + 1;
	ОбластьПодписиШкалы = ДокументРезультат.Область(НомерСтроки, КолонкаШкалаНачало(), НомерСтроки, КолонкаШкалаНачало() + ШиринаШкалыСегментов() - 1);
	ОбластьПодписиШкалы.Объединить();
	ОбластьПодписиШкалы.Текст = СтрШаблон(
		"0 — %1   |   норма %2 – %3",
		Формат(Описание.МаксШкалы, "ЧДЦ=2"),
		Формат(Описание.МинНорма, "ЧДЦ=1"),
		Формат(Описание.МаксНорма, "ЧДЦ=1"));
	ОбластьПодписиШкалы.ЦветТекста = Новый Цвет(100, 116, 139);
	ОбластьПодписиШкалы.Шрифт = Новый Шрифт(, 8);
	ОбластьПодписиШкалы.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьПодписиШкалы.ЦветФона = Новый Цвет(248, 250, 252);
	УстановитьВысотуСтроки(ОбластьПодписиШкалы, 14);
	
	НомерСтроки = НомерСтроки + 1;
	ОбластьПодсказки = ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки, ПоследняяКолонка());
	ОбластьПодсказки.Объединить();
	ОбластьПодсказки.ЦветФона = Новый Цвет(248, 250, 252);
	ОбластьПодсказки.Текст = Описание.ТекстНормы;
	ОбластьПодсказки.ЦветТекста = Новый Цвет(100, 116, 139);
	ОбластьПодсказки.Шрифт = Новый Шрифт(, 8);
	ОбластьПодсказки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	УстановитьВысотуСтроки(ОбластьПодсказки, 18);
	ПрименитьРамку(ОбластьПодсказки);
	
	Возврат НомерСтроки + 1;
	
КонецФункции

Процедура ВывестиЛегенду(ДокументРезультат, НомерСтроки)
	
	ОбластьЛегенды = ДокументРезультат.Область(НомерСтроки, 1, НомерСтроки + 3, ПоследняяКолонка());
	ОбластьЛегенды.Объединить();
	ОбластьЛегенды.Текст =
		"Как читать отчёт:" + Символы.ПС
		+ "• Коэффициент — фактическое значение из бизнес-аналитики." + Символы.ПС
		+ "• Цветная шкала — зелёная зона: норма, ▼ маркер: факт (синий — в норме, оранжевый — ниже, голубой — выше), серый — вне нормы." + Символы.ПС
		+ "• Оценка БА — шкала 0–5: 4,5+ Отлично | 3,5+ Хорошо | 2,5+ Удовлетворительно | 1,5+ Низкая | ниже — Критично.";
	ОбластьЛегенды.ЦветФона = Новый Цвет(241, 245, 249);
	ОбластьЛегенды.ЦветТекста = Новый Цвет(71, 85, 105);
	ОбластьЛегенды.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ПрименитьРамку(ОбластьЛегенды);
	
КонецПроцедуры

Процедура НарисоватьЦветнуюШкалу(ДокументРезультат, НомерСтроки, Коэффициент, Описание)
	
	ДлинаШкалы = ШиринаШкалыСегментов();
	МаксШкалы = Описание.МаксШкалы;
	ЦветТрека = Новый Цвет(203, 213, 225);
	ЦветНорма = Новый Цвет(74, 222, 128);
	ЦветМаркер = Новый Цвет(29, 78, 216);
	ЦветНижеНормы = Новый Цвет(249, 115, 22);
	ЦветВышеНормы = Новый Цвет(59, 130, 246);
	ЛинияСегмента = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
	ПозицияЗначения = 0;
	Если Коэффициент <> Неопределено Тогда
		ПозицияЗначения = Цел(Мин(ДлинаШкалы, Макс(1, Коэффициент / МаксШкалы * ДлинаШкалы)));
	КонецЕсли;
	
	НачалоНормы = Цел(Мин(ДлинаШкалы, Макс(1, Описание.МинНорма / МаксШкалы * ДлинаШкалы)));
	КонецНормы = Цел(Мин(ДлинаШкалы, Макс(1, Описание.МаксНорма / МаксШкалы * ДлинаШкалы)));
	
	Для Индекс = 1 По ДлинаШкалы Цикл
		ОбластьСегмента = ДокументРезультат.Область(НомерСтроки, КолонкаШкалаНачало() + Индекс - 1);
		
		Если Индекс = ПозицияЗначения И Коэффициент <> Неопределено Тогда
			Если Коэффициент < Описание.МинНорма Тогда
				ОбластьСегмента.ЦветФона = ЦветНижеНормы;
			ИначеЕсли Коэффициент > Описание.МаксНорма Тогда
				ОбластьСегмента.ЦветФона = ЦветВышеНормы;
			Иначе
				ОбластьСегмента.ЦветФона = ЦветМаркер;
			КонецЕсли;
			ОбластьСегмента.Текст = "▼";
			ОбластьСегмента.ЦветТекста = Новый Цвет(255, 255, 255);
			ОбластьСегмента.Шрифт = Новый Шрифт(, 9, Истина);
		ИначеЕсли Индекс >= НачалоНормы И Индекс <= КонецНормы Тогда
			ОбластьСегмента.ЦветФона = ЦветНорма;
		Иначе
			ОбластьСегмента.ЦветФона = ЦветТрека;
		КонецЕсли;
		
		ОбластьСегмента.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьСегмента.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		ОбластьСегмента.Обвести(ЛинияСегмента, ЛинияСегмента, ЛинияСегмента, ЛинияСегмента);
	КонецЦикла;
	
КонецПроцедуры

Функция РассчитатьОценкуПоКоэффициенту(Коэффициент, Описание)
	
	Если Коэффициент = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МинНорма = Описание.МинНорма;
	МаксНорма = Описание.МаксНорма;
	
	Если Коэффициент >= МинНорма И Коэффициент <= МаксНорма Тогда
		Возврат 5;
	КонецЕсли;
	
	Если Коэффициент < МинНорма Тогда
		Если Коэффициент < МинНорма * 0.5 Тогда
			Возврат 0;
		ИначеЕсли Коэффициент < МинНорма * 0.7 Тогда
			Возврат 1.5;
		Иначе
			Возврат 2.5;
		КонецЕсли;
	КонецЕсли;
	
	КритМакс = МаксНорма * 1.5;
	Если Коэффициент > КритМакс * 1.3 Тогда
		Возврат 1.5;
	ИначеЕсли Коэффициент > КритМакс Тогда
		Возврат 2.5;
	Иначе
		Возврат 3.5;
	КонецЕсли;
	
КонецФункции

Функция НормализованнаяОценка(Оценка)
	
	Если Оценка = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Оценка > 1 Тогда
		Возврат Мин(1, Оценка / 5);
	КонецЕсли;
	
	Возврат Оценка;
	
КонецФункции

Функция ИнтерпретацияОценки(Оценка)
	
	Результат = Новый Структура("Уровень, Описание, ЦветФона, ЦветТекста");
	НормОценка = НормализованнаяОценка(Оценка);
	
	Если НормОценка >= 0.9 Тогда
		Результат.Уровень = "Отлично";
		Результат.Описание = "Ликвидность в норме, риски минимальны";
		Результат.ЦветФона = Новый Цвет(187, 247, 208);
		Результат.ЦветТекста = Новый Цвет(22, 78, 56);
	ИначеЕсли НормОценка >= 0.7 Тогда
		Результат.Уровень = "Хорошо";
		Результат.Описание = "Ликвидность на приемлемом уровне";
		Результат.ЦветФона = Новый Цвет(209, 250, 229);
		Результат.ЦветТекста = Новый Цвет(22, 78, 56);
	ИначеЕсли НормОценка >= 0.5 Тогда
		Результат.Уровень = "Удовлетворительно";
		Результат.Описание = "Требуется контроль отдельных коэффициентов ликвидности";
		Результат.ЦветФона = Новый Цвет(254, 243, 199);
		Результат.ЦветТекста = Новый Цвет(120, 83, 14);
	ИначеЕсли НормОценка >= 0.3 Тогда
		Результат.Уровень = "Низкая";
		Результат.Описание = "Ликвидность неустойчива, нужны корректирующие меры";
		Результат.ЦветФона = Новый Цвет(254, 215, 170);
		Результат.ЦветТекста = Новый Цвет(154, 52, 18);
	Иначе
		Результат.Уровень = "Критично";
		Результат.Описание = "Критический уровень ликвидности";
		Результат.ЦветФона = Новый Цвет(254, 202, 202);
		Результат.ЦветТекста = Новый Цвет(153, 27, 27);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнтерпретацияПоказателя(Коэффициент, Оценка, Описание)
	
	Интерпретация = ИнтерпретацияОценки(?(Оценка = Неопределено, 0, Оценка));
	
	Если Коэффициент <> Неопределено Тогда
		Если Коэффициент < Описание.МинНорма Тогда
			Интерпретация.Описание = Описание.ТекстНизко;
		ИначеЕсли Коэффициент > Описание.МаксНорма Тогда
			Интерпретация.Описание = Описание.ТекстВысоко;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Интерпретация;
	
КонецФункции

Процедура ПрименитьРамку(Область, Толщина = 1)
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, Толщина);
	Область.Обвести(Линия, Линия, Линия, Линия);
	
КонецПроцедуры

Процедура УстановитьВысотуСтроки(Область, Высота)
	
	Область.ВысотаСтроки = Высота;
	
КонецПроцедуры

Процедура УстановитьШиринуКолонки(ДокументРезультат, НомерКолонки, Ширина)
	
	ДокументРезультат.Область(1, НомерКолонки).ШиринаКолонки = Ширина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
